<template>
  <div class="cards">
    <div class="card">
      <div class="card_header">
        <p>Прибыль</p>
        <div class="card_header_icon">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="24"
            height="24"
            viewBox="0 0 24 24"
            fill="none"
          >
            <path
              d="M12 22.5C6.21 22.5 1.5 17.79 1.5 12C1.5 6.21 6.21 1.5 12 1.5C17.79 1.5 22.5 6.21 22.5 12C22.5 17.79 17.79 22.5 12 22.5ZM12 3C7.035 3 3 7.035 3 12C3 16.965 7.035 21 12 21C16.965 21 21 16.965 21 12C21 7.035 16.965 3 12 3Z"
              fill="black"
            />
            <path
              d="M9.75 19.5C9.33 19.5 9 19.17 9 18.75V13.5H6.75C6.33 13.5 6 13.17 6 12.75C6 12.33 6.33 12 6.75 12H9V6.75C9 6.33 9.33 6 9.75 6H14.25C15.2446 6 16.1984 6.39509 16.9017 7.09835C17.6049 7.80161 18 8.75544 18 9.75C18 10.7446 17.6049 11.6984 16.9017 12.4017C16.1984 13.1049 15.2446 13.5 14.25 13.5H10.5V18.75C10.5 19.17 10.17 19.5 9.75 19.5ZM10.5 12H14.25C15.495 12 16.5 10.995 16.5 9.75C16.5 8.505 15.495 7.5 14.25 7.5H10.5V12Z"
              fill="black"
            />
            <path
              d="M14.25 16.5H6.75C6.33 16.5 6 16.17 6 15.75C6 15.33 6.33 15 6.75 15H14.25C14.67 15 15 15.33 15 15.75C15 16.17 14.67 16.5 14.25 16.5Z"
              fill="black"
            />
          </svg>
        </div>
      </div>
      <h3>11,35 млн ₽</h3>
      <div class="card_footer">
        <div class="card_header_icon">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="24"
            height="24"
            viewBox="0 0 24 24"
            fill="none"
          >
            <path
              d="M2 12C2 7.286 2 4.929 3.464 3.464C4.93 2 7.286 2 12 2C16.714 2 19.071 2 20.535 3.464C22 4.93 22 7.286 22 12C22 16.714 22 19.071 20.535 20.535C19.072 22 16.714 22 12 22C7.286 22 4.929 22 3.464 20.535C2 19.072 2 16.714 2 12Z"
              stroke="#71DD4B"
              stroke-width="1.5"
            />
            <path
              d="M7 14L9.293 11.707C9.48053 11.5195 9.73484 11.4142 10 11.4142C10.2652 11.4142 10.5195 11.5195 10.707 11.707L12.293 13.293C12.4805 13.4805 12.7348 13.5858 13 13.5858C13.2652 13.5858 13.5195 13.4805 13.707 13.293L17 10M17 10V12.5M17 10H14.5"
              stroke="#71DD4B"
              stroke-width="1.5"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
          </svg>
        </div>

        <p>+15% от предущего месяца</p>
      </div>
    </div>
    <div class="card">
      <div class="card_header">
        <p>Траты</p>
        <div class="card_header_icon">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="24"
            height="24"
            viewBox="0 0 24 24"
            fill="none"
          >
            <path
              d="M4.693 4.82397C5.64408 3.84986 6.78065 3.07612 8.03563 2.54841C9.29061 2.02071 10.6386 1.74973 12 1.75147C17.647 1.75147 22.225 6.32897 22.225 11.976C22.225 17.623 17.647 22.201 12 22.201C6.353 22.201 1.775 17.6225 1.775 11.9755C1.775 10.0025 2.3345 8.15997 3.3025 6.59747"
              stroke="black"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
            <path
              d="M15.4095 11.9119C15.4095 12.2028 15.2939 12.4818 15.0883 12.6874C14.8826 12.8931 14.6036 13.0087 14.3127 13.0087C14.0219 13.0087 13.7429 12.8931 13.5372 12.6874C13.3315 12.4818 13.216 12.2028 13.216 11.9119C13.216 11.3064 13.707 10.8154 14.3125 10.8154C14.918 10.8154 15.4095 11.3064 15.4095 11.9119Z"
              stroke="black"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
            <path
              d="M12.3245 8.52003H17.6795C18.0481 8.51924 18.4019 8.66485 18.6631 8.92485C18.9243 9.18486 19.0716 9.53797 19.0725 9.90653V13.9115C19.0732 14.2801 18.9274 14.6338 18.6673 14.895C18.4072 15.1561 18.0541 15.3032 17.6855 15.304H12.3245C11.9559 15.3048 11.6021 15.1592 11.3409 14.8992C11.0797 14.6392 10.9324 14.2861 10.9315 13.9175V9.91253C10.9311 9.72999 10.9667 9.54917 11.0362 9.38037C11.1056 9.21158 11.2077 9.05813 11.3365 8.92877C11.4653 8.79942 11.6183 8.6967 11.7868 8.62649C11.9553 8.55627 12.136 8.51992 12.3185 8.51953H12.3245V8.52003Z"
              stroke="black"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
            <path
              d="M17.925 15.2811V16.6561C17.9255 16.8386 17.89 17.0195 17.8205 17.1883C17.7511 17.3571 17.6491 17.5106 17.5204 17.64C17.3916 17.7694 17.2386 17.8722 17.0702 17.9424C16.9017 18.0127 16.721 18.0491 16.5385 18.0496H7.205C7.02246 18.05 6.84164 18.0144 6.67284 17.9449C6.50405 17.8754 6.35059 17.7734 6.22124 17.6446C6.09189 17.5158 5.98917 17.3628 5.91896 17.1943C5.84874 17.0258 5.81239 16.8451 5.812 16.6626V7.29608C5.81161 7.11354 5.84717 6.93271 5.91666 6.76392C5.98615 6.59513 6.08821 6.44167 6.217 6.31232C6.34579 6.18297 6.49881 6.08025 6.6673 6.01003C6.83579 5.93982 7.01646 5.90347 7.199 5.90308H16.5315C16.9001 5.90241 17.2538 6.04816 17.5149 6.30826C17.7761 6.56835 17.9232 6.92151 17.924 7.29008V8.54208M0.725 8.28158L3.4225 6.30558L3.785 9.62958"
              stroke="black"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
          </svg>
        </div>
      </div>
      <h3>2,75 млн ₽</h3>
      <div class="card_footer">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="24"
          height="24"
          viewBox="0 0 24 24"
          fill="none"
        >
          <path
            d="M2 12C2 7.286 2 4.929 3.464 3.464C4.93 2 7.286 2 12 2C16.714 2 19.071 2 20.535 3.464C22 4.93 22 7.286 22 12C22 16.714 22 19.071 20.535 20.535C19.072 22 16.714 22 12 22C7.286 22 4.929 22 3.464 20.535C2 19.072 2 16.714 2 12Z"
            stroke="#FF3629"
            stroke-width="1.5"
          />
          <path
            d="M7 10L9.293 12.293C9.48053 12.4805 9.73484 12.5858 10 12.5858C10.2652 12.5858 10.5195 12.4805 10.707 12.293L12.293 10.707C12.4805 10.5195 12.7348 10.4142 13 10.4142C13.2652 10.4142 13.5195 10.5195 13.707 10.707L17 14M17 14V11.5M17 14H14.5"
            stroke="#FF3629"
            stroke-width="1.5"
            stroke-linecap="round"
            stroke-linejoin="round"
          />
        </svg>
        <p>-2% от предущего месяца</p>
      </div>
    </div>
  </div>
  <CoffeeShopCards />
</template>

<script setup>
import CoffeeShopCards from "@/components/CoffeeShopCards.vue";
</script>

<style lang="scss" scoped>
.cards {
  display: flex;
  justify-content: space-between;
}

.card {
  border: 1px solid rgba(0, 0, 0, 0.2);
  background-color: #fff;
  border-radius: 30px;
  margin-right: 10px;
  padding: 24px;
  height: 150px;
  width: 260px;
  flex-shrink: 1;
  font-family: "Inter", sans-serif;
  font-size: 16px;

  &_header {
    display: flex;
    justify-content: space-between;
    align-items: center;
    width: 200px;
    & .card_header_icon {
      background-color: #d9d9d9;
      border-radius: 50%;
      width: 38px;
      height: 38px;
      display: flex;
      justify-content: center;
      align-items: center;
    }
  }
  &_footer {
    display: flex;
    justify-content: space-between;
    gap: 5px;
    width: 178px;
    margin-top: 10px;
  }
}
</style>
